<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0588befeb7f08c0c51432278ab487bf40b53846690eb704f1ac976bbb0ae9268","plan_job_ref":"Job Environment Main - Plan #1878 at https://github.com/jarrod-lowe/wildsea/actions/runs/18253361572","plan_out_hash":"505b62633c96050c75a428fab497ee11966158b34103c6a89081ad091f5321d1","plan_hash":"ae87797a799f05cb9c56f860321b7c3f2d34a63374431b8fc35e9b3bf802b1cf","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
sns_alarm_topic_arn  = "arn:aws:sns:ap-southeast-2:453430506965:Pushover"
```
</details>
<details>
<summary>Plan: 0 to add, 10 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.expire_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "expire_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_expireAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.finalise_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "finalise_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_finaliseAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.graphql_lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "graphql_lambda" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "lambda:InvokeFunction",
            ]
+           resources = [
+               "arn:aws:lambda:ap-southeast-2:021891603679:function:Wildsea-primary-generate-presigned-url",
            ]
        }
    }

  # module.wildsea.aws_appsync_function.function["generatePresignedUrl"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/generatePresignedUrl/generatePresignedUrl.ts
            import { util } from "@aws-appsync/utils";
            function request(context) {
              const payload = {
                assetData: context.prev.result.assetData,
                input: context.prev.result.input
              };
              return {
                operation: "Invoke",
                payload
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              const result = context.result;
              const assetData = result.assetData;
              return {
                asset: {
                  gameId: assetData.gameId,
                  sectionId: assetData.sectionId,
                  assetId: assetData.assetId,
                  label: assetData.label,
                  status: assetData.status,
                  mimeType: assetData.mimeType,
                  sizeBytes: assetData.sizeBytes,
                  createdAt: assetData.createdAt,
                  updatedAt: assetData.updatedAt,
                  type: assetData.type
                },
                uploadUrl: result.uploadUrl,
          -     uploadFields: JSON.stringify(result.uploadFields)
          +     uploadFields: JSON.stringify(result.uploadFields),
          +     headers: JSON.stringify(result.headers)
              };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2VuZXJhdGVQcmVzaWduZWRVcmwudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjtBQUd2QixTQUFTLFFBQVEsU0FBMkI7QUFFakQsUUFBTSxVQUFVO0FBQUEsSUFDZCxXQUFXLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDL0IsT0FBTyxRQUFRLEtBQUssT0FBTztBQUFBLEVBQzdCO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1g7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBNEM7QUFDbkUsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsUUFBTSxTQUFTLFFBQVE7QUFDdkIsUUFBTSxZQUFZLE9BQU87QUFFekIsU0FBTztBQUFBLElBQ0wsT0FBTztBQUFBLE1BQ0wsUUFBUSxVQUFVO0FBQUEsTUFDbEIsV0FBVyxVQUFVO0FBQUEsTUFDckIsU0FBUyxVQUFVO0FBQUEsTUFDbkIsT0FBTyxVQUFVO0FBQUEsTUFDakIsUUFBUSxVQUFVO0FBQUEsTUFDbEIsVUFBVSxVQUFVO0FBQUEsTUFDcEIsV0FBVyxVQUFVO0FBQUEsTUFDckIsV0FBVyxVQUFVO0FBQUEsTUFDckIsV0FBVyxVQUFVO0FBQUEsTUFDckIsTUFBTSxVQUFVO0FBQUEsSUFDbEI7QUFBQSxJQUNBLFdBQVcsT0FBTztBQUFBLElBQ2xCLGNBQWMsS0FBSyxVQUFVLE9BQU8sWUFBWTtBQUFBLEVBQ2xEO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2VuZXJhdGVQcmVzaWduZWRVcmwudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjtBQUd2QixTQUFTLFFBQVEsU0FBMkI7QUFFakQsUUFBTSxVQUFVO0FBQUEsSUFDZCxXQUFXLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDL0IsT0FBTyxRQUFRLEtBQUssT0FBTztBQUFBLEVBQzdCO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1g7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBNEM7QUFDbkUsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsUUFBTSxTQUFTLFFBQVE7QUFDdkIsUUFBTSxZQUFZLE9BQU87QUFFekIsU0FBTztBQUFBLElBQ0wsT0FBTztBQUFBLE1BQ0wsUUFBUSxVQUFVO0FBQUEsTUFDbEIsV0FBVyxVQUFVO0FBQUEsTUFDckIsU0FBUyxVQUFVO0FBQUEsTUFDbkIsT0FBTyxVQUFVO0FBQUEsTUFDakIsUUFBUSxVQUFVO0FBQUEsTUFDbEIsVUFBVSxVQUFVO0FBQUEsTUFDcEIsV0FBVyxVQUFVO0FBQUEsTUFDckIsV0FBVyxVQUFVO0FBQUEsTUFDckIsV0FBVyxVQUFVO0FBQUEsTUFDckIsTUFBTSxVQUFVO0FBQUEsSUFDbEI7QUFBQSxJQUNBLFdBQVcsT0FBTztBQUFBLElBQ2xCLGNBQWMsS0FBSyxVQUFVLE9BQU8sWUFBWTtBQUFBLElBQ2hELFNBQVMsS0FBSyxVQUFVLE9BQU8sT0FBTztBQUFBLEVBQ3hDO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-4izth3qoinct5nycvmqrgtv6vm"
        name                      = "generatePresignedUrl"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_function.function["requestAssetUpload"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/requestAssetUpload/requestAssetUpload.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants/entityTypes.ts
            var TypeAsset = "ASSET";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
            
            // lib/constants/assets.ts
            var MAX_ASSET_SIZE_BYTES = 0;
            var ASSET_CLEANUP_TIMEOUT_SECONDS = 30;
            var ALLOWED_ASSET_MIME_TYPES = [
              "image/jpeg",
              "image/png",
              "image/gif",
              "image/webp"
            ];
            
            // function/requestAssetUpload/requestAssetUpload.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              const input = context.arguments.input;
              const assetId = util.autoId();
              const timestamp = util.time.nowISO8601();
              const expireUploadAtSeconds = util.time.nowEpochSeconds() + ASSET_CLEANUP_TIMEOUT_SECONDS;
              const expireUploadAt = util.time.epochMilliSecondsToISO8601(
                expireUploadAtSeconds * 1e3
              );
              if (!ALLOWED_ASSET_MIME_TYPES.includes(input.mimeType)) {
                util.error(
                  "Invalid mime type. Only images are allowed.",
                  "InvalidMimeType"
                );
              }
              if (input.sizeBytes > MAX_ASSET_SIZE_BYTES) {
                util.error(
                  `File size too large. Maximum ${MAX_ASSET_SIZE_BYTES / (1024 * 1024)}MB allowed.`,
                  "FileTooLarge"
                );
              }
              const bucket = `wildsea-${environment_default.name}-assets`;
          +   const incomingKey = `incoming/game/${input.gameId}/section/${input.sectionId}/${assetId}/original`;
              const originalKey = `asset/game/${input.gameId}/section/${input.sectionId}/${assetId}/original`;
              const variantsPrefix = `asset/game/${input.gameId}/section/${input.sectionId}/${assetId}/variants/`;
              const assetData = {
                gameId: input.gameId,
                sectionId: input.sectionId,
                assetId,
                label: input.label || void 0,
                status: ASSET_STATUS_PENDING,
                bucket,
          +     incomingKey,
                originalKey,
                variantsPrefix,
                mimeType: input.mimeType,
                sizeBytes: input.sizeBytes,
                createdAt: timestamp,
                updatedAt: timestamp,
                expireUploadAt,
                type: TypeAsset
              };
              const assetItem = {
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixAsset + "#" + assetId
                }),
                attributeValues: util.dynamodb.toMapValues(assetData)
              };
              const gameItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixGame
                }),
                update: {
                  expression: "SET #updatedAt = :updatedAt, #remainingAssets = #remainingAssets - :one",
                  expressionNames: {
                    "#updatedAt": "updatedAt",
                    "#remainingAssets": "remainingAssets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":updatedAt": timestamp,
                    ":one": 1
                  })
                },
                condition: {
                  expression: "#remainingAssets > :zero",
                  expressionNames: {
                    "#remainingAssets": "remainingAssets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":zero": 0
                  }),
                  returnValuesOnConditionCheckFailure: false
                }
              };
              const sectionItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + input.sectionId
                }),
                update: {
                  expression: "SET #updatedAt = :updatedAt, #assets = list_append(if_not_exists(#assets, :emptyList), :assetList)",
                  expressionNames: {
                    "#updatedAt": "updatedAt",
                    "#assets": "assets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":updatedAt": timestamp,
                    ":emptyList": [],
                    ":assetList": [assetId]
                  })
                },
                condition: {
                  expression: "#userId = :userId",
                  expressionNames: {
                    "#userId": "userId"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":userId": identity.sub
                  }),
                  returnValuesOnConditionCheckFailure: false
                }
              };
              context.stash.assetData = assetData;
              context.stash.input = input;
              return {
                operation: "TransactWriteItems",
                transactItems: [assetItem, gameItem, sectionItem]
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return {
                assetData: context.stash.assetData,
                input: context.stash.input
              };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsicmVxdWVzdEFzc2V0VXBsb2FkLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9lbnRpdHlUeXBlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RiUHJlZml4ZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9hc3NldFN0YXR1cy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNTVixJQUFNLFlBQVk7OztBQ1RsQixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQVd6QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCOzs7QUNFN0IsSUFBTSx1QkFBdUI7QUFHN0IsSUFBTSxnQ0FBZ0M7QUFRdEMsSUFBTSwyQkFBMkI7QUFBQSxFQUN0QztBQUFBLEVBQ0E7QUFBQSxFQUNBO0FBQUEsRUFDQTtBQUNGOzs7QUxETyxTQUFTLFFBQ2QsU0FDbUM7QUFDbkMsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFVBQVUsS0FBSyxPQUFPO0FBQzVCLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUd2QyxRQUFNLHdCQUNKLEtBQUssS0FBSyxnQkFBZ0IsSUFBSTtBQUNoQyxRQUFNLGlCQUFpQixLQUFLLEtBQUs7QUFBQSxJQUMvQix3QkFBd0I7QUFBQSxFQUMxQjtBQUdBLE1BQUksQ0FBQyx5QkFBeUIsU0FBUyxNQUFNLFFBQVEsR0FBRztBQUN0RCxTQUFLO0FBQUEsTUFDSDtBQUFBLE1BQ0E7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLE1BQUksTUFBTSxZQUFZLHNCQUFzQjtBQUMxQyxTQUFLO0FBQUEsTUFDSCxnQ0FBZ0Msd0JBQXdCLE9BQU8sS0FBSztBQUFBLE1BQ3BFO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLFNBQVMsV0FBVyxvQkFBWSxJQUFJO0FBQzFDLFFBQU0sY0FBYyxjQUFjLE1BQU0sTUFBTSxZQUFZLE1BQU0sU0FBUyxJQUFJLE9BQU87QUFDcEYsUUFBTSxpQkFBaUIsY0FBYyxNQUFNLE1BQU0sWUFBWSxNQUFNLFNBQVMsSUFBSSxPQUFPO0FBR3ZGLFFBQU0sWUFBdUI7QUFBQSxJQUMzQixRQUFRLE1BQU07QUFBQSxJQUNkLFdBQVcsTUFBTTtBQUFBLElBQ2pCO0FBQUEsSUFDQSxPQUFPLE1BQU0sU0FBUztBQUFBLElBQ3RCLFFBQVE7QUFBQSxJQUNSO0FBQUEsSUFDQTtBQUFBLElBQ0E7QUFBQSxJQUNBLFVBQVUsTUFBTTtBQUFBLElBQ2hCLFdBQVcsTUFBTTtBQUFBLElBQ2pCLFdBQVc7QUFBQSxJQUNYLFdBQVc7QUFBQSxJQUNYO0FBQUEsSUFDQSxNQUFNO0FBQUEsRUFDUjtBQUVBLFFBQU0sWUFBWTtBQUFBLElBQ2hCLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGlCQUFpQixNQUFNO0FBQUEsSUFDN0IsQ0FBQztBQUFBLElBQ0QsaUJBQWlCLEtBQUssU0FBUyxZQUFZLFNBQVM7QUFBQSxFQUN0RDtBQUdBLFFBQU0sV0FBVztBQUFBLElBQ2YsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQ0U7QUFBQSxNQUNGLGlCQUFpQjtBQUFBLFFBQ2YsY0FBYztBQUFBLFFBQ2Qsb0JBQW9CO0FBQUEsTUFDdEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLGNBQWM7QUFBQSxRQUNkLFFBQVE7QUFBQSxNQUNWLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLG9CQUFvQjtBQUFBLE1BQ3RCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxTQUFTO0FBQUEsTUFDWCxDQUFDO0FBQUEsTUFDRCxxQ0FBcUM7QUFBQSxJQUN2QztBQUFBLEVBQ0Y7QUFHQSxRQUFNLGNBQWM7QUFBQSxJQUNsQixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSSxtQkFBbUIsTUFBTSxNQUFNO0FBQUEsSUFDckMsQ0FBQztBQUFBLElBQ0QsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixjQUFjO0FBQUEsUUFDZCxXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsY0FBYztBQUFBLFFBQ2QsY0FBYyxDQUFDO0FBQUEsUUFDZixjQUFjLENBQUMsT0FBTztBQUFBLE1BQ3hCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxXQUFXLFNBQVM7QUFBQSxNQUN0QixDQUFDO0FBQUEsTUFDRCxxQ0FBcUM7QUFBQSxJQUN2QztBQUFBLEVBQ0Y7QUFHQSxVQUFRLE1BQU0sWUFBWTtBQUMxQixVQUFRLE1BQU0sUUFBUTtBQUV0QixTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxlQUFlLENBQUMsV0FBVyxVQUFVLFdBQVc7QUFBQSxFQUNsRDtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUdBLFNBQU87QUFBQSxJQUNMLFdBQVcsUUFBUSxNQUFNO0FBQUEsSUFDekIsT0FBTyxRQUFRLE1BQU07QUFBQSxFQUN2QjtBQUNGOyIsCiAgIm5hbWVzIjogW10KfQo=
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsicmVxdWVzdEFzc2V0VXBsb2FkLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9lbnRpdHlUeXBlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RiUHJlZml4ZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9hc3NldFN0YXR1cy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNTVixJQUFNLFlBQVk7OztBQ1RsQixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQVd6QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCOzs7QUNFN0IsSUFBTSx1QkFBdUI7QUFHN0IsSUFBTSxnQ0FBZ0M7QUFRdEMsSUFBTSwyQkFBMkI7QUFBQSxFQUN0QztBQUFBLEVBQ0E7QUFBQSxFQUNBO0FBQUEsRUFDQTtBQUNGOzs7QUxETyxTQUFTLFFBQ2QsU0FDbUM7QUFDbkMsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFVBQVUsS0FBSyxPQUFPO0FBQzVCLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUd2QyxRQUFNLHdCQUNKLEtBQUssS0FBSyxnQkFBZ0IsSUFBSTtBQUNoQyxRQUFNLGlCQUFpQixLQUFLLEtBQUs7QUFBQSxJQUMvQix3QkFBd0I7QUFBQSxFQUMxQjtBQUdBLE1BQUksQ0FBQyx5QkFBeUIsU0FBUyxNQUFNLFFBQVEsR0FBRztBQUN0RCxTQUFLO0FBQUEsTUFDSDtBQUFBLE1BQ0E7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLE1BQUksTUFBTSxZQUFZLHNCQUFzQjtBQUMxQyxTQUFLO0FBQUEsTUFDSCxnQ0FBZ0Msd0JBQXdCLE9BQU8sS0FBSztBQUFBLE1BQ3BFO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLFNBQVMsV0FBVyxvQkFBWSxJQUFJO0FBQzFDLFFBQU0sY0FBYyxpQkFBaUIsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUN2RixRQUFNLGNBQWMsY0FBYyxNQUFNLE1BQU0sWUFBWSxNQUFNLFNBQVMsSUFBSSxPQUFPO0FBQ3BGLFFBQU0saUJBQWlCLGNBQWMsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUd2RixRQUFNLFlBQXVCO0FBQUEsSUFDM0IsUUFBUSxNQUFNO0FBQUEsSUFDZCxXQUFXLE1BQU07QUFBQSxJQUNqQjtBQUFBLElBQ0EsT0FBTyxNQUFNLFNBQVM7QUFBQSxJQUN0QixRQUFRO0FBQUEsSUFDUjtBQUFBLElBQ0E7QUFBQSxJQUNBO0FBQUEsSUFDQTtBQUFBLElBQ0EsVUFBVSxNQUFNO0FBQUEsSUFDaEIsV0FBVyxNQUFNO0FBQUEsSUFDakIsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1g7QUFBQSxJQUNBLE1BQU07QUFBQSxFQUNSO0FBRUEsUUFBTSxZQUFZO0FBQUEsSUFDaEIsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksaUJBQWlCLE1BQU07QUFBQSxJQUM3QixDQUFDO0FBQUEsSUFDRCxpQkFBaUIsS0FBSyxTQUFTLFlBQVksU0FBUztBQUFBLEVBQ3REO0FBR0EsUUFBTSxXQUFXO0FBQUEsSUFDZixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSTtBQUFBLElBQ04sQ0FBQztBQUFBLElBQ0QsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixjQUFjO0FBQUEsUUFDZCxvQkFBb0I7QUFBQSxNQUN0QjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsY0FBYztBQUFBLFFBQ2QsUUFBUTtBQUFBLE1BQ1YsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2Ysb0JBQW9CO0FBQUEsTUFDdEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFNBQVM7QUFBQSxNQUNYLENBQUM7QUFBQSxNQUNELHFDQUFxQztBQUFBLElBQ3ZDO0FBQUEsRUFDRjtBQUdBLFFBQU0sY0FBYztBQUFBLElBQ2xCLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLG1CQUFtQixNQUFNLE1BQU07QUFBQSxJQUNyQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUNFO0FBQUEsTUFDRixpQkFBaUI7QUFBQSxRQUNmLGNBQWM7QUFBQSxRQUNkLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxjQUFjO0FBQUEsUUFDZCxjQUFjLENBQUM7QUFBQSxRQUNmLGNBQWMsQ0FBQyxPQUFPO0FBQUEsTUFDeEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFdBQVcsU0FBUztBQUFBLE1BQ3RCLENBQUM7QUFBQSxNQUNELHFDQUFxQztBQUFBLElBQ3ZDO0FBQUEsRUFDRjtBQUdBLFVBQVEsTUFBTSxZQUFZO0FBQzFCLFVBQVEsTUFBTSxRQUFRO0FBRXRCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLGVBQWUsQ0FBQyxXQUFXLFVBQVUsV0FBVztBQUFBLEVBQ2xEO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBMkI7QUFDbEQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBR0EsU0FBTztBQUFBLElBQ0wsV0FBVyxRQUFRLE1BQU07QUFBQSxJQUN6QixPQUFPLFFBQVEsTUFBTTtBQUFBLEVBQ3ZCO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-mtrvona5g5g3bloziirrapvpw4"
        name                      = "requestAssetUpload"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                updateJoinCode(input: UpdateJoinCodeInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createNPC(input: CreateNPCInput!): PlayerSheetSummary! @aws_cognito_user_pools
                rollDice(input: RollDiceInput!): DiceRoll! @aws_cognito_user_pools
                updateUserSettings(input: UpdateUserSettingsInput!): UserSettings! @aws_cognito_user_pools
                setSystemNotification(input: SetSystemNotificationInput!): SystemNotification! @aws_iam
                requestAssetUpload(input: RequestAssetUploadInput!): AssetUploadTicket! @aws_cognito_user_pools
                _expireAsset(input: ExpireAssetInput!): Asset! @aws_iam
                _finaliseAsset(input: FinaliseAssetInput!): Asset! @aws_iam
                deleteAsset(input: DeleteAssetInput!): Asset! @aws_cognito_user_pools @aws_iam
            }
            
            type GamesWithQuota @aws_cognito_user_pools {
              games: [PlayerSheetSummary!]!
              remainingGames: Int!
              totalQuota: Int!
            }
            
            type Query {
                getGame(input: GetGameInput!): Game! @aws_cognito_user_pools
                getGames: GamesWithQuota! @aws_cognito_user_pools
                getGameTypes(input: GetGameTypesInput!): [GameTypeMetadata!]! @aws_cognito_user_pools
                getCharacterTemplates(input: GetCharacterTemplatesInput!): [CharacterTemplateMetadata!]! @aws_cognito_user_pools
                getCharacterTemplate(input: GetCharacterTemplateInput!): [TemplateSectionData!]! @aws_cognito_user_pools
                getGamePresets(input: GetGamePresetsInput!): [GamePresetItem!]! @aws_cognito_user_pools
                getUserSettings: UserSettings @aws_cognito_user_pools
                getSystemNotification: SystemNotification @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createNPC", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame", "updateJoinCode"])
              diceRolled(gameId: ID!): DiceRoll @aws_subscribe(mutations: ["rollDice"])
              updatedUserSettings: UserSettings @aws_subscribe(mutations: ["updateUserSettings"])
              systemNotificationUpdated: SystemNotification @aws_subscribe(mutations: ["setSystemNotification"])
              updatedAsset(gameId: ID!): Asset @aws_subscribe(mutations: ["_expireAsset", "_finaliseAsset", "deleteAsset"])
            }
            
            input GetGameInput {
              gameId: ID!
              language: String!
            }
            
            input GetGameTypesInput {
              language: String!
            }
            
            input GetCharacterTemplatesInput {
              gameType: String!
              language: String!
            }
            
            input GetCharacterTemplateInput {
              templateName: String!
              gameType: String!
              language: String!
            }
            
            input GetGamePresetsInput {
              dataSetName: String!
              language: String!
            }
            
            input CreateGameInput {
                name: String!
                gameType: String!
                description: String
                language: String!
            }
            
            input JoinGameInput {
              joinCode: String!
              language: String!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input UpdateJoinCodeInput {
              gameId: ID!
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
              remainingAssets: Int!
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
              remainingAssets: Int!
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateNPCInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              remainingSections: Int!
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              gmUserId: ID!
              remainingSections: Int!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              assets: [String!]
            }
            
            union Dice = SingleDie
            
            input DiceInput {
              type: String!
              size: Int!
              modifier: Int
            }
            
            input RollDiceInput {
              gameId: ID!
              dice: [DiceInput!]!
              action: String
              rollType: String!
              target: Int!
              onBehalfOf: ID
              messageType: String
            }
            
            type DiceRoll @aws_cognito_user_pools {
              gameId: ID!
              playerId: ID!
              playerName: String!
              dice: [Dice!]!
              rollType: String!
              target: Int!
              grade: String!
              action: String
              diceList: [Dice!]!
              value: Int!
              rolledAt: AWSDateTime!
              rolledBy: String!
              proxyRoll: Boolean!
              type: String!
              messageIndex: Int!
              messageType: String
            }
            
            type SingleDie @aws_cognito_user_pools {
              type: String!
              size: Int!
              value: Int!
            }
            
            type GameTypeMetadata @aws_cognito_user_pools {
              gameType: String!
              displayName: String!
              language: String!
            }
            
            type CharacterTemplateMetadata @aws_cognito_user_pools {
              templateName: String!
              displayName: String!
              gameType: String!
              language: String!
            }
            
            type TemplateSectionData @aws_cognito_user_pools {
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
            }
            
            type GamePresetItem @aws_cognito_user_pools {
              displayName: String!
              data: AWSJSON!
              language: String!
            }
            
            type UserSettings @aws_cognito_user_pools {
              userId: ID!
              settings: AWSJSON!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            input UpdateUserSettingsInput {
              settings: AWSJSON!
              language: String!
            }
            
            input SetSystemNotificationInput {
              message: String
              urgent: Boolean
            }
            
            type SystemNotification @aws_cognito_user_pools @aws_iam {
              message: String
              urgent: Boolean!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            type Asset @aws_cognito_user_pools @aws_iam {
              gameId: ID!
              sectionId: ID!
              assetId: ID!
              label: String
              status: AssetStatus!
              mimeType: String!
              sizeBytes: Int
              width: Int
              height: Int
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
            }
            
            enum AssetStatus {
              PENDING
              READY
              EXPIRED
              CANCELED
            }
            
            type AssetUploadTicket @aws_cognito_user_pools {
              asset: Asset!
              uploadUrl: AWSURL!
              uploadFields: AWSJSON!
          +   headers: AWSJSON!
            }
            
            input RequestAssetUploadInput {
              gameId: ID!
              sectionId: ID!
              mimeType: String!
              sizeBytes: Int!
              label: String
            }
            
            input ExpireAssetInput {
              gameId: ID!
              assetId: ID!
            }
            
            input FinaliseAssetInput {
              gameId: ID!
              assetId: ID!
              sectionId: ID!
            }
            
            input DeleteAssetInput {
              gameId: ID!
              sectionId: ID!
              assetId: ID!
            }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (12 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.expire_asset_bus will be updated in-place
!~  resource "aws_iam_policy" "expire_asset_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-expire-asset-bus"
        name             = "Wildsea-primary-expire-asset-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_expireAsset"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.finalise_asset_bus will be updated in-place
!~  resource "aws_iam_policy" "finalise_asset_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-finalise-asset-bus"
        name             = "Wildsea-primary-finalise-asset-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_finaliseAsset"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.graphql_lambda will be updated in-place
!~  resource "aws_iam_policy" "graphql_lambda" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-graphql-lambda"
        name             = "Wildsea-primary-graphql-lambda"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "lambda:InvokeFunction"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:lambda:ap-southeast-2:021891603679:function:Wildsea-primary-generate-presigned-url"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "Wildsea-primary"
        }
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_lambda_function.generate_presigned_url will be updated in-place
!~  resource "aws_lambda_function" "generate_presigned_url" {
        id                             = "Wildsea-primary-generate-presigned-url"
!~      last_modified                  = "2025-09-27T21:48:29.744+0000" -> (known after apply)
!~      source_code_hash               = "d23Q3bdmmjld9KNP5/E3DoLACDGdAZKohb/inar3KPo=" -> "hNdDlimwJHpql/Mbp1MSNYv48OJF8HJ9WHQ0lDKyTB4="
        tags                           = {
            "Name" = "Wildsea-primary-generate-presigned-url"
        }
#        (29 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # module.wildsea.aws_s3_bucket_lifecycle_configuration.assets will be updated in-place
!~  resource "aws_s3_bucket_lifecycle_configuration" "assets" {
        id                                     = "wildsea-primary-assets"
#        (4 unchanged attributes hidden)

+       rule {
+           id     = "cleanup-incoming-directory"
+           status = "Enabled"
#            (1 unchanged attribute hidden)

+           expiration {
+               days                         = 1
+               expired_object_delete_marker = false
            }

+           filter {
+               prefix = "incoming/"
            }
        }

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_s3_bucket_notification.assets_events will be updated in-place
!~  resource "aws_s3_bucket_notification" "assets_events" {
        id          = "wildsea-primary-assets"
#        (3 unchanged attributes hidden)

!~      queue {
+           filter_prefix = "incoming/"
            id            = "tf-s3-queue-20250930092912733100000001"
#            (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 10 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with module.wildsea.aws_s3_bucket_lifecycle_configuration.assets_logs,
  on ../../module/wildsea/asset-bucket.tf line 111, in resource "aws_s3_bucket_lifecycle_configuration" "assets_logs":
 111: resource "aws_s3_bucket_lifecycle_configuration" "assets_logs" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and 2 more similar warnings elsewhere)

Warning: Deprecated attribute

  on ../../module/wildsea/deleter.tf line 9, in locals:
   9:     data.aws_region.current.name,

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 7 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Environment Main - Plan #1878](https://github.com/jarrod-lowe/wildsea/actions/runs/18253361572)